In [1]:
import pandas as pd
import numpy as np

## Basic functions

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[4,56,8,9],[1,2,4,5], [5,767,8,9],[1,2,3,9]], columns=['A1','B1','C1','D1'])

In [11]:
df1.head(3)

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [12]:
df1.tail(2)

   A1   B1  C1  D1
5   5  767   8   9
6   1    2   3   9

In [13]:
df1

   A1   B1  C1  D1
0   1    2   3   4
1   5    6   7   8
2   9   10  11  12
3   4   56   8   9
4   1    2   4   5
5   5  767   8   9
6   1    2   3   9

## Slicing

In [14]:
df1.shape

(7, 4)

In [15]:
df1.iloc[0:2,0:2]

   A1  B1
0   1   2
1   5   6